# Ordenando

In [1]:
import pandas as pd 
import numpy as np

In [16]:
empresas= {'Empresas':['Empresa A','Empresa B','Empresa C','Empresa D'],
            'Ventas':[2000000,2000000,1234000,100000],
            'Costos':[600000,543678,235453,21464],
            'Ciudad':['Buenos Aires','Los Angeles','México','Miami'],
            'Piezas':[500,1234,6542,2344]}

In [17]:
df=pd.DataFrame(empresas,index=[1,3,2,5])

In [18]:
df

    Empresas   Ventas  Costos        Ciudad  Piezas
1  Empresa A  2000000  600000  Buenos Aires     500
3  Empresa B  2000000  543678   Los Angeles    1234
2  Empresa C  1234000  235453        México    6542
5  Empresa D   100000   21464         Miami    2344

In [19]:
df.sort_index()

    Empresas   Ventas  Costos        Ciudad  Piezas
1  Empresa A  2000000  600000  Buenos Aires     500
2  Empresa C  1234000  235453        México    6542
3  Empresa B  2000000  543678   Los Angeles    1234
5  Empresa D   100000   21464         Miami    2344

In [20]:
df.sort_values('Ventas')

    Empresas   Ventas  Costos        Ciudad  Piezas
5  Empresa D   100000   21464         Miami    2344
2  Empresa C  1234000  235453        México    6542
1  Empresa A  2000000  600000  Buenos Aires     500
3  Empresa B  2000000  543678   Los Angeles    1234

In [21]:
df.sort_values('Ventas',ascending=False)

    Empresas   Ventas  Costos        Ciudad  Piezas
1  Empresa A  2000000  600000  Buenos Aires     500
3  Empresa B  2000000  543678   Los Angeles    1234
2  Empresa C  1234000  235453        México    6542
5  Empresa D   100000   21464         Miami    2344

In [23]:
#Sort by 2 columns
df.sort_values(['Ventas','Piezas'],ascending=False)

    Empresas   Ventas  Costos        Ciudad  Piezas
3  Empresa B  2000000  543678   Los Angeles    1234
1  Empresa A  2000000  600000  Buenos Aires     500
2  Empresa C  1234000  235453        México    6542
5  Empresa D   100000   21464         Miami    2344

In [24]:
df.sort_values(['Ventas','Costos'],ascending=False)

    Empresas   Ventas  Costos        Ciudad  Piezas
1  Empresa A  2000000  600000  Buenos Aires     500
3  Empresa B  2000000  543678   Los Angeles    1234
2  Empresa C  1234000  235453        México    6542
5  Empresa D   100000   21464         Miami    2344

# Filtrando

In [25]:
df

    Empresas   Ventas  Costos        Ciudad  Piezas
1  Empresa A  2000000  600000  Buenos Aires     500
3  Empresa B  2000000  543678   Los Angeles    1234
2  Empresa C  1234000  235453        México    6542
5  Empresa D   100000   21464         Miami    2344

In [26]:
df['Empresas']=='Empresa A'

1     True
3    False
2    False
5    False
Name: Empresas, dtype: bool

In [30]:
df[df['Empresas']=='Empresa A']

    Empresas   Ventas  Costos        Ciudad  Piezas
1  Empresa A  2000000  600000  Buenos Aires     500

In [32]:
df1=df[df['Empresas']=='Empresa A']
df1

    Empresas   Ventas  Costos        Ciudad  Piezas
1  Empresa A  2000000  600000  Buenos Aires     500

### OR

In [33]:
(df['Empresas']=='Empresa A') | (df['Empresas']=='Empresa B')

1     True
3     True
2    False
5    False
Name: Empresas, dtype: bool

In [34]:
df[(df['Empresas']=='Empresa A') | (df['Empresas']=='Empresa B')]

    Empresas   Ventas  Costos        Ciudad  Piezas
1  Empresa A  2000000  600000  Buenos Aires     500
3  Empresa B  2000000  543678   Los Angeles    1234

### AND

In [35]:
df[(df['Empresas']=='Empresa A') & (df['Piezas']>100)]

    Empresas   Ventas  Costos        Ciudad  Piezas
1  Empresa A  2000000  600000  Buenos Aires     500

In [36]:
df[df['Ventas']>1000000]

    Empresas   Ventas  Costos        Ciudad  Piezas
1  Empresa A  2000000  600000  Buenos Aires     500
3  Empresa B  2000000  543678   Los Angeles    1234
2  Empresa C  1234000  235453        México    6542

In [37]:
df[(df['Ventas']>1000000) & (df['Ciudad']=='Miami')]

Empty DataFrame
Columns: [Empresas, Ventas, Costos, Ciudad, Piezas]
Index: []

In [38]:
df[(df['Ventas']>1000000) & (df['Ciudad']=='México')]

    Empresas   Ventas  Costos  Ciudad  Piezas
2  Empresa C  1234000  235453  México    6542